package uli.nick.job4j.praxis.tasks111firstprogram;

/**
 * <p>3.2. Похвали себя за проделанную работу
 * <p>Напишите программу, которая выводит на консоль строчку "Сегодня я молодец!"
 */

public class Praise {
    public static void main(String[] args) {
        System.out.println("Сегодня я молодец!");
    }
}

// Каркас 3.2.:
//public class Praise {
//    public static void main(String[] args) {
//
//    }
//}
//.
